## Series

In [3]:
import pandas as pd
import numpy as np

In [4]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a':10, 'b':20, 'c':30}

In [5]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [7]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'Rússia', 'Japão'])

In [10]:
ser1

EUA         1
Alemanha    2
Rússia      3
Japão       4
dtype: int64

In [11]:
ser2 = pd.Series([1, 2, 5, 4], index = ['EUA', 'Alemanha', 'Itália', 'Japão'])

In [12]:
ser2

EUA         1
Alemanha    2
Itália      5
Japão       4
dtype: int64

In [13]:
ser1[['EUA', 'Alemanha', 'Rússia']]

EUA         1
Alemanha    2
Rússia      3
dtype: int64

In [14]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
Rússia      NaN
dtype: float64

## DataFrames

In [15]:
from numpy.random import randn

In [16]:
df = pd.DataFrame(randn(5,4), index= ["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [17]:
df

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718
C  0.293563 -2.490846 -1.126296 -0.135005
D  0.166091  0.871050  1.414203 -0.191163
E -0.733859 -1.875064 -0.086812 -0.170496

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df[['W']]

          W
A -0.600660
B -0.914408
C  0.293563
D  0.166091
E -0.733859

In [20]:
df['new'] = df['W'] + df['X']

In [21]:
df

          W         X         Y         Z       new
A -0.600660  0.290218  1.407204  1.109579 -0.310442
B -0.914408  0.232275 -0.545438 -0.979718 -0.682133
C  0.293563 -2.490846 -1.126296 -0.135005 -2.197284
D  0.166091  0.871050  1.414203 -0.191163  1.037140
E -0.733859 -1.875064 -0.086812 -0.170496 -2.608923

In [22]:
df2 = df.drop('new', axis=1)

In [23]:
df

          W         X         Y         Z       new
A -0.600660  0.290218  1.407204  1.109579 -0.310442
B -0.914408  0.232275 -0.545438 -0.979718 -0.682133
C  0.293563 -2.490846 -1.126296 -0.135005 -2.197284
D  0.166091  0.871050  1.414203 -0.191163  1.037140
E -0.733859 -1.875064 -0.086812 -0.170496 -2.608923

In [24]:
df2

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718
C  0.293563 -2.490846 -1.126296 -0.135005
D  0.166091  0.871050  1.414203 -0.191163
E -0.733859 -1.875064 -0.086812 -0.170496

In [25]:
df.drop('new', axis=1, inplace=True)

In [26]:
df

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718
C  0.293563 -2.490846 -1.126296 -0.135005
D  0.166091  0.871050  1.414203 -0.191163
E -0.733859 -1.875064 -0.086812 -0.170496

In [27]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718

In [31]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718

In [32]:
df

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718
C  0.293563 -2.490846 -1.126296 -0.135005
D  0.166091  0.871050  1.414203 -0.191163
E -0.733859 -1.875064 -0.086812 -0.170496

In [45]:
df.iloc[:-1, 1:4]

          X         Y         Z
A  0.290218  1.407204  1.109579
B  0.232275 -0.545438 -0.979718
C -2.490846 -1.126296 -0.135005
D  0.871050  1.414203 -0.191163

In [50]:
df.iloc[1:3, 2:]

          Y         Z
B -0.545438 -0.979718
C -1.126296 -0.135005

In [51]:
df

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
B -0.914408  0.232275 -0.545438 -0.979718
C  0.293563 -2.490846 -1.126296 -0.135005
D  0.166091  0.871050  1.414203 -0.191163
E -0.733859 -1.875064 -0.086812 -0.170496

In [52]:
df > 0

       W      X      Y      Z
A  False   True   True   True
B  False   True  False  False
C   True  False  False  False
D   True   True   True  False
E  False  False  False  False

In [53]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.290218  1.407204  1.109579
B       NaN  0.232275       NaN       NaN
C  0.293563       NaN       NaN       NaN
D  0.166091  0.871050  1.414203       NaN
E       NaN       NaN       NaN       NaN

In [54]:
df['Y'] > 0

A     True
B    False
C    False
D     True
E    False
Name: Y, dtype: bool

In [55]:
df[df['Y'] > 0]

          W         X         Y         Z
A -0.600660  0.290218  1.407204  1.109579
D  0.166091  0.871050  1.414203 -0.191163

In [56]:
df[(df['Y'] > 0) & (df['Z'] > 0)]

         W         X         Y         Z
A -0.60066  0.290218  1.407204  1.109579